# Даны три числа. Написать "yes", если среди них есть одинаковые.
numone = int(input("enter three integers"))
numtwo = int(input())
numthree = int(input())
if numone == numtwo or numone == numthree or numthree == numtwo:
   print("yes")

